Filip83/ecos-devel/ecos-3.0/packages/devs/serial/avr32/uc3c/current/src/avr32_serial.c
//==========================================================================
//
//      avr32_serial.c
//
//      Atmel AV32UC3C Serial I/O Interface Module (PDMA driven)
//
//==========================================================================
// ####ECOSGPLCOPYRIGHTBEGIN####                                            
// -------------------------------------------                              
// This file is part of eCos, the Embedded Configurable Operating System.   
// Copyright (C) 1998, 1999, 2000, 2001, 2002 Free Software Foundation, Inc.
//
// eCos is free software; you can redistribute it and/or modify it under    
// the terms of the GNU General Public License as published by the Free     
// Software Foundation; either version 2 or (at your option) any later      
// version.                                                                 
//
// eCos is distributed in the hope that it will be useful, but WITHOUT      
// ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or    
// FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License    
// for more details.                                                        
//
// You should have received a copy of the GNU General Public License        
// along with eCos; if not, write to the Free Software Foundation, Inc.,    
// 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.            
//
// As a special exception, if other files instantiate templates or use      
// macros or inline functions from this file, or you compile this file      
// and link it with other works to produce a work based on this file,       
// this file does not by itself cause the resulting work to be covered by   
// the GNU General Public License. However the source code for this file    
// must still be made available in accordance with section (3) of the GNU   
// General Public License v2.                                               
//
// This exception does not invalidate any other reasons why a work based    
// on this file might be covered by the GNU General Public License.         
// -------------------------------------------                              
// ####ECOSGPLCOPYRIGHTEND####                                              
//==========================================================================
//#####DESCRIPTIONBEGIN####
//
// Author(s):     Filip
// Contributors:  
// Original data: gthomas
// Date:          2014-05-10
// Purpose:       Atmel AVR32UC3C Serial I/O module (PDMA driven version)
// Description: 
//
//####DESCRIPTIONEND####
//
//==========================================================================
#if 0
#include <cyg/hal/gpio.h>
#include <cyg/hal/avr32/io.h>

#include <pkgconf/hal.h>
#include <pkgconf/infra.h>
#include <pkgconf/system.h>
#include <pkgconf/io_serial.h>
#include <pkgconf/io.h>
#include <pkgconf/kernel.h>
#include <pkgconf/io_serial_avr32_uc3c.h>

#include <cyg/io/io.h>
#include <cyg/hal/hal_io.h>
#include <cyg/hal/hal_intr.h>
#include <cyg/io/devtab.h>
#include <cyg/io/serial.h>
#include <cyg/infra/diag.h>
#include <cyg/infra/cyg_type.h>
#include <cyg/infra/cyg_ass.h>
#include <cyg/hal/pdca.h>
#include <cyg/hal/board_config.h>


#if CYGINT_IO_SERIAL_BLOCK_TRANSFER == 0
#undef CYGINT_IO_SERIAL_BLOCK_TRANSFER
#endif

externC void * memcpy( void *, const void *, size_t );

#ifndef CYGPKG_IO_SERIAL_AVR32

#include "avr32_serial.h"


#define RCVBUF_EXTRA        16
#define RCV_TIMEOUT         1005

#define SIFLG_NONE          0x00
#define SIFLG_TX_READY      0x01
#define SIFLG_XMIT_BUSY     0x02
#define SIFLG_XMIT_CONTINUE 0x04


typedef struct avr32_serial_info {
    volatile                        avr32_usart_t  *usart_dev;
    CYG_WORD                        int_num;
    CYG_WORD                        int_num_dma_rx;
    CYG_WORD                        int_num_dma_tx;
    cyg_uint32                      stat;
    int                             transmit_size;
    cyg_interrupt                   serial_interrupt;
    cyg_handle_t                    serial_interrupt_handle;
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    cyg_interrupt                   serial_dma_tx_interrupt;
    cyg_handle_t                    serial_dma_tx_interrupt_handle;
    cyg_uint8                       *rcv_buffer[2];
    cyg_uint8                       dma_tx_ch;
    cyg_uint8                       dma_pid_tx;
    volatile avr32_pdca_channel_t   *pdca_tx_channel;

    cyg_interrupt                   serial_dma_rx_interrupt;
    cyg_handle_t                    serial_dma_rx_interrupt_handle;
    cyg_uint8                       dma_rx_ch;
    cyg_uint8                       dma_pid_rx;
    volatile avr32_pdca_channel_t   *pdca_rx_channel;
    cyg_uint8                       curbuf;
    cyg_uint16                      ping_pong_size;
    cyg_uint8                       *end;
    cyg_bool                        trans_rdy;
#endif
    cyg_uint8                       flags;
} avr32_serial_info;

static bool avr32_serial_init(struct cyg_devtab_entry *tab);
static bool avr32_serial_putc_interrupt(serial_channel *chan, unsigned char c);
#if (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL0) && CYGNUM_IO_SERIAL_AVR32_SERIAL0_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL1) && CYGNUM_IO_SERIAL_AVR32_SERIAL1_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL2) && CYGNUM_IO_SERIAL_AVR32_SERIAL2_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL3) && CYGNUM_IO_SERIAL_AVR32_SERIAL3_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL4) && CYGNUM_IO_SERIAL_AVR32_SERIAL4_BUFSIZE == 0)
static bool avr32_serial_putc_polled(serial_channel *chan, unsigned char c);
#endif
static Cyg_ErrNo avr32_serial_lookup(struct cyg_devtab_entry **tab, 
                                    struct cyg_devtab_entry *sub_tab,
                                    const char *name);
static unsigned char avr32_serial_getc_interrupt(serial_channel *chan);
#if (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL0) && CYGNUM_IO_SERIAL_AVR32_SERIAL0_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL1) && CYGNUM_IO_SERIAL_AVR32_SERIAL1_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL2) && CYGNUM_IO_SERIAL_AVR32_SERIAL2_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL3) && CYGNUM_IO_SERIAL_AVR32_SERIAL3_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL4) && CYGNUM_IO_SERIAL_AVR32_SERIAL4_BUFSIZE == 0)
static unsigned char avr32_serial_getc_polled(serial_channel *chan);
#endif
static Cyg_ErrNo avr32_serial_set_config(serial_channel *chan, cyg_uint32 key,
                                        const void *xbuf, cyg_uint32 *len);
static void avr32_serial_start_xmit(serial_channel *chan);
static void avr32_serial_stop_xmit(serial_channel *chan);

static cyg_uint32 avr32_serial_ISR(cyg_vector_t vector, cyg_addrword_t data);
static void       avr32_serial_DSR(cyg_vector_t vector, cyg_ucount32 count, cyg_addrword_t data);

