Filip83/ecos-devel/ecos-3.0/packages/devs/serial/avr32/uc3c/current/src/avr32_serial.c
#if (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL0) && CYGNUM_IO_SERIAL_AVR32_SERIAL0_BUFSIZE > 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL1) && CYGNUM_IO_SERIAL_AVR32_SERIAL1_BUFSIZE > 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL2) && CYGNUM_IO_SERIAL_AVR32_SERIAL2_BUFSIZE > 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL3) && CYGNUM_IO_SERIAL_AVR32_SERIAL3_BUFSIZE > 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL4) && CYGNUM_IO_SERIAL_AVR32_SERIAL4_BUFSIZE > 0) 
static SERIAL_FUNS(avr32_serial_funs_interrupt, 
                   avr32_serial_putc_interrupt, 
                   avr32_serial_getc_interrupt,
                   avr32_serial_set_config,
                   avr32_serial_start_xmit,
                   avr32_serial_stop_xmit
    );
#endif

#if (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL0) && CYGNUM_IO_SERIAL_AVR32_SERIAL0_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL1) && CYGNUM_IO_SERIAL_AVR32_SERIAL1_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL2) && CYGNUM_IO_SERIAL_AVR32_SERIAL2_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL3) && CYGNUM_IO_SERIAL_AVR32_SERIAL3_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL4) && CYGNUM_IO_SERIAL_AVR32_SERIAL4_BUFSIZE == 0)
static SERIAL_FUNS(avr32_serial_funs_polled, 
                   avr32_serial_putc_polled, 
                   avr32_serial_getc_polled,
                   avr32_serial_set_config,
                   avr32_serial_start_xmit,
                   avr32_serial_stop_xmit
    );
#endif

#ifdef CYGPKG_IO_SERIAL_AVR32_SERIAL0
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
static cyg_uint8 avr32_serial_rcv_buffer_0
    [2][CYGNUM_IO_SERIAL_AVR32_SERIAL0_PING_PONG_BUFSIZE];
#endif
static avr32_serial_info avr32_serial_info0 = {
    usart_dev       : (avr32_usart_t*) AVR32_USART0_ADDRESS,
    int_num         : CYGNUM_HAL_VECTOR_USART0,
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    int_num_dma_rx  : CYGNUM_HAL_VECTOR_PDMA_CH4,
    dma_rx_ch       : 4,
    dma_pid_rx      : AVR32_PDCA_PID_USART0_RX,
    int_num_dma_tx  : CYGNUM_HAL_VECTOR_PDMA_CH5,
    dma_pid_tx      : AVR32_PDCA_PID_USART0_TX,
    dma_tx_ch       : 5,
    ping_pong_size  : CYGNUM_IO_SERIAL_AVR32_SERIAL0_PING_PONG_BUFSIZE,
    rcv_buffer      : {avr32_serial_rcv_buffer_0[0], avr32_serial_rcv_buffer_0[1]},
    trans_rdy       : false
#endif
};

#if CYGNUM_IO_SERIAL_AVR32_SERIAL0_BUFSIZE > 0
static unsigned char avr32_serial_out_buf0[CYGNUM_IO_SERIAL_AVR32_SERIAL0_BUFSIZE];
static unsigned char avr32_serial_in_buf0[CYGNUM_IO_SERIAL_AVR32_SERIAL0_BUFSIZE];

static SERIAL_CHANNEL_USING_INTERRUPTS(
                    avr32_serial_channel0,
                    avr32_serial_funs_interrupt, 
                    avr32_serial_info0,
                    CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_AVR32_SERIAL0_BAUD),
                    CYG_SERIAL_STOP_DEFAULT,
                    CYG_SERIAL_PARITY_DEFAULT,
                    CYG_SERIAL_WORD_LENGTH_DEFAULT,
                    CYG_SERIAL_FLAGS_DEFAULT,
                    &avr32_serial_out_buf0[0], sizeof(avr32_serial_out_buf0),
                    &avr32_serial_in_buf0[0], sizeof(avr32_serial_in_buf0)
    );
#else
static SERIAL_CHANNEL(
                    avr32_serial_channel0,
                    avr32_serial_funs_polled, 
                    avr32_serial_info0,
                    CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_AVR32_SERIAL0_BAUD),
                    CYG_SERIAL_STOP_DEFAULT,
                    CYG_SERIAL_PARITY_DEFAULT,
                    CYG_SERIAL_WORD_LENGTH_DEFAULT,
                    CYG_SERIAL_FLAGS_DEFAULT
    );
#endif

DEVTAB_ENTRY(avr32_serial_io0, 
             CYGDAT_IO_SERIAL_AVR32_SERIAL0_NAME,
             0,                     // Does not depend on a lower level interface
             &cyg_io_serial_devio, 
             avr32_serial_init, 
             avr32_serial_lookup,   // Serial driver may need initializing
             &avr32_serial_channel0
    );
#endif //  CYGPKG_IO_SERIAL_AVR32_SERIAL1

#ifdef CYGPKG_IO_SERIAL_AVR32_SERIAL1
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
static cyg_uint8 avr32_serial_rcv_buffer_1
    [2][CYGNUM_IO_SERIAL_AVR32_SERIAL1_PING_PONG_BUFSIZE];
#endif
static avr32_serial_info avr32_serial_info1 = {
    usart_dev       : (avr32_usart_t*) AVR32_USART1_ADDRESS,
    int_num         : CYGNUM_HAL_VECTOR_USART1,
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    int_num_dma_rx  : CYGNUM_HAL_VECTOR_PDMA_CH6,
    dma_rx_ch       : 6,
    dma_pid_rx      : AVR32_PDCA_PID_USART1_RX,
    int_num_dma_tx  : CYGNUM_HAL_VECTOR_PDMA_CH7,
    dma_pid_tx      : AVR32_PDCA_PID_USART1_TX,
    dma_tx_ch       : 7,
    ping_pong_size   : CYGNUM_IO_SERIAL_AVR32_SERIAL1_PING_PONG_BUFSIZE,
    rcv_buffer      : {avr32_serial_rcv_buffer_1[0], avr32_serial_rcv_buffer_1[1]},
    trans_rdy       : false
#endif
};
#if CYGNUM_IO_SERIAL_AVR32_SERIAL1_BUFSIZE > 0
static unsigned char avr32_serial_out_buf1[CYGNUM_IO_SERIAL_AVR32_SERIAL1_BUFSIZE];
static unsigned char avr32_serial_in_buf1[CYGNUM_IO_SERIAL_AVR32_SERIAL1_BUFSIZE];

static SERIAL_CHANNEL_USING_INTERRUPTS(
                    avr32_serial_channel1,
                    avr32_serial_funs_interrupt, 
                    avr32_serial_info1,
                    CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_AVR32_SERIAL1_BAUD),
                    CYG_SERIAL_STOP_DEFAULT,
                    CYG_SERIAL_PARITY_DEFAULT,
                    CYG_SERIAL_WORD_LENGTH_DEFAULT,
                    CYG_SERIAL_FLAGS_DEFAULT,
                    &avr32_serial_out_buf1[0], sizeof(avr32_serial_out_buf1),
                    &avr32_serial_in_buf1[0], sizeof(avr32_serial_in_buf1)
    );
#else
static SERIAL_CHANNEL(
                    avr32_serial_channel1,
                    avr32_serial_funs_polled, 
                    avr32_serial_info1,
                    CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_AVR32_SERIAL1_BAUD),
                    CYG_SERIAL_STOP_DEFAULT,
                    CYG_SERIAL_PARITY_DEFAULT,
                    CYG_SERIAL_WORD_LENGTH_DEFAULT,
                    CYG_SERIAL_FLAGS_DEFAULT
    );
#endif

DEVTAB_ENTRY(avr32_serial_io1, 
             CYGDAT_IO_SERIAL_AVR32_SERIAL1_NAME,
             0,                     // Does not depend on a lower level interface
             &cyg_io_serial_devio, 
             avr32_serial_init, 
             avr32_serial_lookup,     // Serial driver may need initializing
             &avr32_serial_channel1
    );
#endif //  CYGPKG_IO_SERIAL_AVR32_SERIAL1


#ifdef CYGPKG_IO_SERIAL_AVR32_SERIAL2
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
static cyg_uint8 avr32_serial_rcv_buffer_2
    [2][CYGNUM_IO_SERIAL_AVR32_SERIAL2_PING_PONG_BUFSIZE];
#endif
static avr32_serial_info avr32_serial_info2 = {
    usart_dev       : (avr32_usart_t*) AVR32_USART2_ADDRESS,
    int_num         : CYGNUM_HAL_VECTOR_USART2,
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    int_num_dma_rx  : CYGNUM_HAL_VECTOR_PDMA_CH8,
    dma_rx_ch       : 8,
    dma_pid_rx      : AVR32_PDCA_PID_USART2_RX,
    int_num_dma_tx  : CYGNUM_HAL_VECTOR_PDMA_CH9,
    dma_pid_tx      : AVR32_PDCA_PID_USART2_TX,
    dma_tx_ch       : 9,
    ping_pong_size   : CYGNUM_IO_SERIAL_AVR32_SERIAL2_PING_PONG_BUFSIZE,
    rcv_buffer      : {avr32_serial_rcv_buffer_2[0], avr32_serial_rcv_buffer_2[1]},
    trans_rdy       : false
#endif
};

#if CYGNUM_IO_SERIAL_AVR32_SERIAL2_BUFSIZE > 0
static unsigned char avr32_serial_out_buf2[CYGNUM_IO_SERIAL_AVR32_SERIAL2_BUFSIZE];
static unsigned char avr32_serial_in_buf2[CYGNUM_IO_SERIAL_AVR32_SERIAL2_BUFSIZE];

static SERIAL_CHANNEL_USING_INTERRUPTS(
                    avr32_serial_channel2,
                    avr32_serial_funs_interrupt, 
                    avr32_serial_info2,
                    CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_AVR32_SERIAL2_BAUD),0x0181
                    CYG_SERIAL_STOP_DEFAULT,
                    CYG_SERIAL_PARITY_DEFAULT,
                    CYG_SERIAL_WORD_LENGTH_DEFAULT,
                    CYG_SERIAL_FLAGS_DEFAULT,
                    &avr32_serial_out_buf2[0], sizeof(avr32_serial_out_buf2),
                    &avr32_serial_in_buf2[0], sizeof(avr32_serial_in_buf2)
    );
#else
static SERIAL_CHANNEL(
                    avr32_serial_channel2,
                    avr32_serial_funs_polled, 
                    avr32_serial_info2,
                    CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_AVR32_SERIAL2_BAUD),
                    CYG_SERIAL_STOP_DEFAULT,
                    CYG_SERIAL_PARITY_DEFAULT,
                    CYG_SERIAL_WORD_LENGTH_DEFAULT,
                    CYG_SERIAL_FLAGS_DEFAULT
    );
#endif

