Filip83/ecos-devel/ecos-3.0/packages/devs/serial/avr32/uc3c/current/src/avr32_serial.c
DEVTAB_ENTRY(avr32_serial_io2, 
             CYGDAT_IO_SERIAL_AVR32_SERIAL2_NAME,
             0,                     // Does not depend on a lower level interface
             &cyg_io_serial_devio, 
             avr32_serial_init, 
             avr32_serial_lookup,     // Serial driver may need initializing
             &avr32_serial_channel2
    );
#endif //  CYGPKG_IO_SERIAL_AVR32_SERIAL2

#ifdef CYGPKG_IO_SERIAL_AVR32_SERIAL3
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
static cyg_uint8 avr32_serial_rcv_buffer_3
    [2][CYGNUM_IO_SERIAL_AVR32_SERIAL3_PING_PONG_BUFSIZE];
#endif
static avr32_serial_info avr32_serial_info3 = {
    usart_dev       : (avr32_usart_t*) AVR32_USART3_ADDRESS,
    int_num         : CYGNUM_HAL_VECTOR_USART3,
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    int_num_dma_rx  : CYGNUM_HAL_VECTOR_PDMA_CH10,
    dma_rx_ch       : 10,
    dma_pid_rx      : AVR32_PDCA_PID_USART3_RX,
    int_num_dma_tx  : CYGNUM_HAL_VECTOR_PDMA_CH11,
    dma_pid_tx      : AVR32_PDCA_PID_USART3_TX,
    dma_tx_ch       : 11,
    ping_pong_size   : CYGNUM_IO_SERIAL_AVR32_SERIAL3_PING_PONG_BUFSIZE,
    rcv_buffer      : {avr32_serial_rcv_buffer_3[0], avr32_serial_rcv_buffer_3[1]},
    trans_rdy       : false
#endif
};

#if CYGNUM_IO_SERIAL_AVR32_SERIAL3_BUFSIZE > 0
static unsigned char avr32_serial_out_buf3[CYGNUM_IO_SERIAL_AVR32_SERIAL3_BUFSIZE];
static unsigned char avr32_serial_in_buf3[CYGNUM_IO_SERIAL_AVR32_SERIAL3_BUFSIZE];

static SERIAL_CHANNEL_USING_INTERRUPTS(
            avr32_serial_channel3,
            avr32_serial_funs_interrupt, 
            avr32_serial_info3,
            CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_AVR32_SERIAL3_BAUD),
            CYG_SERIAL_STOP_DEFAULT,
            CYG_SERIAL_PARITY_DEFAULT,
            CYG_SERIAL_WORD_LENGTH_DEFAULT,
            CYG_SERIAL_FLAGS_DEFAULT,
            &avr32_serial_out_buf3[0], sizeof(avr32_serial_out_buf3),
            &avr32_serial_in_buf3[0], sizeof(avr32_serial_in_buf3)
    );
#else
static SERIAL_CHANNEL(
                    avr32_serial_channel3,
                    avr32_serial_funs_polled, 
                    avr32_serial_info3,
                    CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_AVR32_SERIAL3_BAUD),
                    CYG_SERIAL_STOP_DEFAULT,
                    CYG_SERIAL_PARITY_DEFAULT,
                    CYG_SERIAL_WORD_LENGTH_DEFAULT,
                    CYG_SERIAL_FLAGS_DEFAULT
    );
#endif

DEVTAB_ENTRY(avr32_serial_io3, 
             CYGDAT_IO_SERIAL_AVR32_SERIAL3_NAME,
             0,                     // Does not depend on a lower level interface
             &cyg_io_serial_devio, 
             avr32_serial_init, 
             avr32_serial_lookup,     // Serial driver may need initializing
             &avr32_serial_channel3
    );
#endif //  CYGPKG_IO_SERIAL_AVR32_SERIAL3

#if defined(CYGPKG_IO_SERIAL_AVR32_SERIAL4) && defined(CYGNUM_HAL_VECTOR_USART4)
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
static cyg_uint8 avr32_serial_rcv_buffer_4
    [2][RCYGNUM_IO_SERIAL_AVR32_SERIAL4_PING_PONG_BUFSIZE];
#endif
static avr32_serial_info avr32_serial_info4 = {
    usart_dev       : (avr32_usart_t*) AVR32_USART4_ADDRESS,
    int_num         : CYGNUM_HAL_VECTOR_USART4,
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    int_num_dma_rx  : CYGNUM_HAL_VECTOR_PDMA_CH12,
    dma_rx_ch       : 12,
    dma_pid_rx      : AVR32_PDCA_PID_USART4_RX,
    int_num_dma_tx  : CYGNUM_HAL_VECTOR_PDMA_CH13,
    dma_pid_tx      : AVR32_PDCA_PID_USART4_TX,
    dma_tx_ch       : 13,
    ping_pong_size   : CYGNUM_IO_SERIAL_AVR32_SERIAL4_PING_PONG_BUFSIZE,
    rcv_buffer      : {avr32_serial_rcv_buffer_4[0], avr32_serial_rcv_buffer_4[1]},
    trans_rdy       : false
#endif
};

#if CYGNUM_IO_SERIAL_AVR32_SERIAL4_BUFSIZE > 0
static unsigned char avr32_serial_out_buf4[CYGNUM_IO_SERIAL_AVR32_SERIAL4_BUFSIZE];
static unsigned char avr32_serial_in_buf4[CYGNUM_IO_SERIAL_AVR32_SERIAL4_BUFSIZE];

static SERIAL_CHANNEL_USING_INTERRUPTS(
            avr32_serial_channel4,
            avr32_serial_funs_interrupt, 
            avr32_serial_info4,
            CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_AVR32_SERIAL4_BAUD),
            CYG_SERIAL_STOP_DEFAULT,
            CYG_SERIAL_PARITY_DEFAULT,
            CYG_SERIAL_WORD_LENGTH_DEFAULT,
            CYG_SERIAL_FLAGS_DEFAULT,
            &avr32_serial_out_buf4[0], sizeof(avr32_serial_out_buf4),
            &avr32_serial_in_buf4[0], sizeof(avr32_serial_in_buf4)
    );
#else
static SERIAL_CHANNEL(
                    avr32_serial_channel4,
                    avr32_serial_funs_polled,
                    avr32_serial_info4,
                    CYG_SERIAL_BAUD_RATE(CYGNUM_IO_SERIAL_AVR32_SERIAL4_BAUD),
                    CYG_SERIAL_STOP_DEFAULT,
                    CYG_SERIAL_PARITY_DEFAULT,
                    CYG_SERIAL_WORD_LENGTH_DEFAULT,
                    CYG_SERIAL_FLAGS_DEFAULT
    );
#endif

DEVTAB_ENTRY(avr32_serial_io4, 
             CYGDAT_IO_SERIAL_AVR32_SERIAL4_NAME,
             0,                     // Does not depend on a lower level interface
             &cyg_io_serial_devio, 
             avr32_serial_init, 
             avr32_serial_lookup,     // Serial driver may need initializing
             &avr32_serial_channel4
    );
#endif //  CYGPKG_IO_SERIAL_AVR32_SERIAL4


// Internal function to actually configure the hardware to desired baud rate, etc.
static bool
avr32_serial_config_port(serial_channel *chan, cyg_serial_info_t *new_config, bool init)
{
    avr32_serial_info * const avr32_chan = (avr32_serial_info *)chan->dev_priv;

    volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
    cyg_uint32 parity = select_parity[new_config->parity];
    cyg_uint32 word_length = 
            select_word_length[new_config->word_length-CYGNUM_SERIAL_WORD_LENGTH_5];
    cyg_uint32 stop_bits = select_stop_bits[new_config->stop - 1]; 
    CYG_ADDRESS usart_addr = (CYG_ADDRESS)avr32_chan->usart_dev;

    if ((word_length == 0xFF) ||
        (parity == 0xFF) ||
        (stop_bits == 0xFF)) {
        return false;  // Unsupported configuration
    }

    if(usart_addr == AVR32_USART0_ADDRESS)
    {
#ifdef CYGPKG_IO_SERIAL_AVR32_SERIAL0
#if CYG_HAL_USART0_TXD_ENABLED == PIN_ENABLE
        gpio_enable_module_pin(CYG_HAL_USART0_TXD_PIN,
                CYG_HAL_USART0_TXD_FUNCTION);
#endif
#if CYG_HAL_USART0_RXD_ENABLED == PIN_ENABLE
        gpio_enable_module_pin(CYG_HAL_USART0_RXD_PIN, 
                CYG_HAL_USART0_RXD_FUNCTION);
#endif
    #ifdef CYGNUM_IO_SERIAL_AVR32_SERIAL0_FLOW_CONTROL
        gpio_enable_module_pin(CYG_HAL_USART0_RTS_PIN, 
                CYG_HAL_USART0_RTS_FUNCTION);
        gpio_enable_module_pin(CYG_HAL_USART0_CTS_PIN, 
                CYG_HAL_USART0_CTS_FUNCTION);
    #endif
#endif
    }else if(usart_addr == AVR32_USART1_ADDRESS)		
    {
#ifdef CYGPKG_IO_SERIAL_AVR32_SERIAL1
#if CYG_HAL_USART1_TXD_ENABLED == PIN_ENABLE
        gpio_enable_module_pin(CYG_HAL_USART1_TXD_PIN,
                CYG_HAL_USART1_TXD_FUNCTION);
#endif
#if CYG_HAL_USART1_RXD_ENABLED == PIN_ENABLE
        gpio_enable_module_pin(CYG_HAL_USART1_RXD_PIN, 
                CYG_HAL_USART1_RXD_FUNCTION);
#endif
    #ifdef  CYGNUM_IO_SERIAL_AVR32_SERIAL1_MODEM_MODE
        gpio_enable_module_pin(CYG_HAL_AVR32_USART1_DTR_PIN,
                CYG_HAL_AVR32_USART1_DTR_FUNCTION);
        gpio_enable_module_pin(CYG_HAL_AVR32_USART1_DSR_PIN, 
                CYG_HAL_AVR32_USART1_DSR_FUNCTION);
        gpio_enable_module_pin(CYG_HAL_AVR32_USART1_DCD_PIN,
                CYG_HAL_AVR32_USART1_DCD_FUNCTION);
        gpio_enable_module_pin(CYG_HAL_AVR32_USART1_RI_PIN,  
                CYG_HAL_AVR32_USART1_RI_FUNCTION);
     #endif
     #if defined(CYGNUM_IO_SERIAL_AVR32_SERIAL1_FLOW_CONTROL) || \
         defined(CYGNUM_IO_SERIAL_AVR32_SERIAL1_MODEM_MODE)
        gpio_enable_module_pin(CYG_HAL_AVR32_USART1_RTS_PIN, 
                CYG_HAL_AVR32_USART1_RTS_FUNCTION);
        gpio_enable_module_pin(CYG_HAL_AVR32_USART1_CTS_PIN, 
                CYG_HAL_AVR32_USART1_CTS_FUNCTION);
     #endif
#endif
    }		
    else if(usart_addr == AVR32_USART2_ADDRESS)
    {
#ifdef CYGPKG_IO_SERIAL_AVR32_SERIAL2
#if CYG_HAL_USART2_TXD_ENABLED == PIN_ENABLE
        gpio_enable_module_pin(CYG_HAL_USART2_TXD_PIN,
                CYG_HAL_USART2_TXD_FUNCTION);
#endif
#if CYG_HAL_USART2_RXD_ENABLED == PIN_ENABLE
        gpio_enable_module_pin(CYG_HAL_USART2_RXD_PIN, 
                CYG_HAL_USART2_RXD_FUNCTION);
#endif
    #ifdef CYGNUM_IO_SERIAL_AVR32_SERIAL2_FLOW_CONTROL
        gpio_enable_module_pin(CYG_HAL_USART2_RTS_PIN, 
                CYG_HAL_USART2_RTS_FUNCTION);
        gpio_enable_module_pin(CYG_HAL_USART2_CTS_PIN, 
                CYG_HAL_USART2_CTS_FUNCTION);
    #endif
#endif
    }	
    else if(usart_addr == AVR32_USART3_ADDRESS)
    {
#ifdef CYGPKG_IO_SERIAL_AVR32_SERIAL3
#if CYG_HAL_USART3_TXD_ENABLED == PIN_ENABLE
        gpio_enable_module_pin(CYG_HAL_USART3_TXD_PIN,
                CYG_HAL_USART3_TXD_FUNCTION);
#endif
#if CYG_HAL_USART3_RXD_ENABLED == PIN_ENABLE
        gpio_enable_module_pin(CYG_HAL_USART3_RXD_PIN, 
                CYG_HAL_USART3_RXD_FUNCTION);
#endif
    #ifdef CYGNUM_IO_SERIAL_AVR32_SERIAL3_FLOW_CONTROL
        gpio_enable_module_pin(CYG_HAL_USART3_RTS_PIN, 
                CYG_HAL_USART3_RTS_FUNCTION);
        gpio_enable_module_pin(CYG_HAL_USART3_CTS_PIN, 
                CYG_HAL_USART3_CTS_FUNCTION);
    #endif
#endif
    }	
#ifdef AVR32_USART4_ADDRESS
    else if(usart_addr == AVR32_USART4_ADDRESS)
    {
#ifdef CYGPKG_IO_SERIAL_AVR32_SERIAL4
#if CYG_HAL_USART4_TXD_ENABLED == PIN_ENABLE
        gpio_enable_module_pin(CYG_HAL_USART4_TXD_PIN,
                CYG_HAL_USART4_TXD_FUNCTION);
#endif
#if CYG_HAL_USART4_RXD_ENABLED == PIN_ENABLE
        gpio_enable_module_pin(CYG_HAL_USART4_RXD_PIN, 
                CYG_HAL_USART4_RXD_FUNCTION);
#endif
    #ifdef CYGNUM_IO_SERIAL_AVR32_SERIAL4_FLOW_CONTROL
        gpio_enable_module_pin(CYG_DEVS_USART4_RTS_PIN, 
                CYG_HAL_USART4_RTS_FUNCTION);
        gpio_enable_module_pin(CYG_DEVS_USART4_CTS_PIN, 
                CYG_HAL_USART4_CTS_FUNCTION);
    #endif
#endif
    }
#endif
    else
    {
        CYG_ASSERT(false,"Unknownd USART address\n");
    }
    // Reset device
    dev->cr = AVR32_USART_CR_RSTRX_MASK | 
              AVR32_USART_CR_RSTTX_MASK | 
              AVR32_USART_CR_RSTSTA_MASK ;

    // Configuration
    if((new_config->flags & CYGNUM_SERIAL_FLOW_RTSCTS_RX) ||
        (new_config->flags & CYGNUM_SERIAL_FLOW_RTSCTS_TX))
        dev->mr = stop_bits | parity | word_length /*| 
                AVR32_USART_MODE_HARDWARE /*| AVR32_USART_MR_OVER_MASK*/;
    else if((new_config->flags & CYGNUM_SERIAL_FLOW_DSRDTR_RX) ||
        (new_config->flags & CYGNUM_SERIAL_FLOW_DSRDTR_TX))
        dev->mr = stop_bits | parity | word_length | 
                AVR32_USART_MODE_MODEM /*| AVR32_USART_MR_OVER_MASK*/;
    else
    {
        dev->mr = stop_bits | parity | word_length | 
                AVR32_USART_MODE_NORMAL /*| AVR32_USART_MR_OVER_MASK*/;
	dev->cr = AVR32_USART_CR_RTSEN_MASK;
    }
 
    // Baud rate
    if(new_config->baud < sizeof(select_baud))
        dev->brgr = select_baud[new_config->baud];
    else
        dev->brgr = DIVISOR(new_config->baud);
    // Disable all interrupts
    dev->idr = 0xFFFFFFFF;

    
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    // Start receiver
    avr32_chan->curbuf = 0;
    avr32_chan->pdca_tx_channel = CYG_PDMA_GET_CHANEL(avr32_chan->dma_tx_ch);
    avr32_chan->pdca_rx_channel = CYG_PDMA_GET_CHANEL(avr32_chan->dma_rx_ch);

    CYG_PDAM_SET_CHANEL(avr32_chan->pdca_rx_channel,
                        avr32_chan->rcv_buffer[0],
                        avr32_chan->ping_pong_size,
                        avr32_chan->dma_pid_rx,
                        0/*avr32_chan->rcv_buffer[1]*/,
                        0/*avr32_chan->ping_pong_size*/,
                        0);

