Filip83/ecos-devel/ecos-3.0/packages/devs/serial/avr32/uc3c/current/src/avr32_serial.c
    avr32_chan->end = avr32_chan->rcv_buffer[0];
    dev->rtor = RCV_TIMEOUT;
#ifdef CYGINT_IO_SERIAL_LINE_STATUS_HW
    dev->ier  = /*AVR32_USART_IER_RXRDY_MASK |*/ AVR32_USART_IER_OVRE_MASK |
                  AVR32_USART_IER_FRAME_MASK | AVR32_USART_IER_PARE_MASK   |
                  AVR32_USART_IER_RXBRK_MASK | AVR32_USART_IER_TIMEOUT_MASK;
   #ifdef CYGOPT_IO_SERIAL_FLOW_CONTROL_HW
      dev->ier = AVR32_USART_CTSIC_MASK /*| AVR32_USART_IER_DCDIC_MASK*/ |
                 /*AVR32_USART_DSRIC_MASK | AVR32_USART_IER_RIIC_MASK  |*/
                 AVR32_USART_IER_TIMEOUT_MASK;
   #endif
#else
    dev->ier  = /*AVR32_USART_IER_RXRDY_MASK |*/ AVR32_USART_IER_TIMEOUT_MASK;
#endif

    CYG_PDMA_ENABLE_CHANEL(avr32_chan->pdca_rx_channel);
    
    // Enable RX and TX
    dev->cr = AVR32_USART_CR_RXEN_MASK  | AVR32_USART_CR_TXEN_MASK |
              AVR32_USART_CR_RTSEN_MASK | AVR32_USART_CR_STTTO_MASK;
				  
    CYG_PDMA_ENABLE_INTERRUPT(avr32_chan->pdca_rx_channel,false,
                                true, false);
#else
    dev->rtor = 0;//RCV_TIMEOUT;
    #ifdef CYGINT_IO_SERIAL_LINE_STATUS_HW
        dev->ier  =   AVR32_USART_IER_RXRDY_MASK | AVR32_USART_IER_OVRE_MASK |
                      AVR32_USART_IER_FRAME_MASK | AVR32_USART_IER_PARE_MASK |
                      AVR32_USART_IER_RXBRK_MASK /*| AVR32_USART_IER_TIMEOUT_MASK*/;
       #ifdef CYGOPT_IO_SERIAL_FLOW_CONTROL_HW
           dev->ier = AVR32_USART_IER_CTSIC_MASK /*| AVR32_USART_IER_DCDIC_MASK |
                      AVR32_USART_IER_DSRIC_MASK | AVR32_USART_IER_RIIC_MASK  |
                      AVR32_USART_IER_TIMEOUT_MASK*/;
       #endif
    #else
        dev->ier  = AVR32_USART_IER_RXRDY_MASK | AVR32_USART_IER_TIMEOUT_MASK;
    #endif

    // Enable RX and TX
    dev->cr = AVR32_USART_CR_RXEN_MASK /*| AVR32_USART_CR_TXEN_MASK*/ |
              AVR32_USART_CR_RTSEN_MASK   | AVR32_USART_CR_STTTO_MASK;

#endif           
    if (new_config != &chan->config) {
        chan->config = *new_config;
    }

    return true;
}

// Function to initialize the device.  Called at bootstrap time.
static bool 
avr32_serial_init(struct cyg_devtab_entry *tab)
{
    serial_channel * const chan = (serial_channel *) tab->priv;
    avr32_serial_info * const avr32_chan = (avr32_serial_info *) chan->dev_priv;
    int res;

#ifdef CYGDBG_IO_INIT
    diag_printf("AVR32 SERIAL init - dev: %x.%d\n", avr32_chan->usart_dev, avr32_chan->int_num);
#endif
   
    avr32_chan->flags = SIFLG_NONE;
    avr32_chan->stat  = 0;
    (chan->callbacks->serial_init)(chan);  // Really only required for interrupt driven devices
    if (chan->out_cbuf.len != 0) {
        //serial interrupt
        cyg_drv_interrupt_create(avr32_chan->int_num,
                                 1,                      // Priority
                                 (cyg_addrword_t)chan,   // Data item passed to interrupt handler
                                 avr32_serial_ISR,
                                 avr32_serial_DSR,
                                 &avr32_chan->serial_interrupt_handle,
                                 &avr32_chan->serial_interrupt);
        cyg_drv_interrupt_attach(avr32_chan->serial_interrupt_handle);
 #ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER   
        //rx pdma interrupt
        cyg_drv_interrupt_create(avr32_chan->int_num_dma_rx,
                                 1,                      // Priority
                                 (cyg_addrword_t)chan,   // Data item passed to interrupt handler
                                 avr32_serial_ISR,
                                 avr32_serial_DSR,
                                 &avr32_chan->serial_dma_rx_interrupt_handle,
                                 &avr32_chan->serial_dma_rx_interrupt);
        cyg_drv_interrupt_attach(avr32_chan->serial_dma_rx_interrupt_handle);

        //tx pdma interrupt
        cyg_drv_interrupt_create(avr32_chan->int_num_dma_tx,
                                 1,                      // Priority
                                 (cyg_addrword_t)chan,   // Data item passed to interrupt handler
                                 avr32_serial_ISR,
                                 avr32_serial_DSR,
                                 &avr32_chan->serial_dma_tx_interrupt_handle,
                                 &avr32_chan->serial_dma_tx_interrupt);
        cyg_drv_interrupt_attach(avr32_chan->serial_dma_tx_interrupt_handle);
#endif      

    }
    res = avr32_serial_config_port(chan, &chan->config, true);
    return res;
}

// This routine is called when the device is "looked" up (i.e. attached)
static Cyg_ErrNo 
avr32_serial_lookup(struct cyg_devtab_entry **tab, 
                  struct cyg_devtab_entry *sub_tab,
                  const char *name)
{
    serial_channel * const chan = (serial_channel *) (*tab)->priv;
    
    (chan->callbacks->serial_init)(chan);  // Really only required for interrupt driven devices
    return ENOERR;
}

// Send a character to the device output buffer.
// Return 'true' if character is sent to device
static bool
avr32_serial_putc_interrupt(serial_channel *chan, unsigned char c)
{
    avr32_serial_info * const avr32_chan = (avr32_serial_info *) chan->dev_priv;
    const bool res = (avr32_chan->flags & SIFLG_XMIT_BUSY) == 0;
    
    if (res)
    {
        volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
        dev->thr = c;
        avr32_chan->flags |= SIFLG_XMIT_BUSY;
    }
    return res;
}

#if (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL0) && CYGNUM_IO_SERIAL_AVR32_SERIAL0_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL1) && CYGNUM_IO_SERIAL_AVR32_SERIAL1_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL2) && CYGNUM_IO_SERIAL_AVR32_SERIAL2_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL3) && CYGNUM_IO_SERIAL_AVR32_SERIAL3_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL4) && CYGNUM_IO_SERIAL_AVR32_SERIAL4_BUFSIZE == 0)
static bool
avr32_serial_putc_polled(serial_channel *chan, unsigned char c)
{
    avr32_serial_info * const avr32_chan = (avr32_serial_info *) chan->dev_priv;
    volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
    
