Filip83/ecos-devel/ecos-3.0/packages/devs/serial/avr32/uc3c/current/src/avr32_serial.c
    while (!dev->CSR.usart_mode.txrdy)
        CYG_EMPTY_STATEMENT;
    dev->thr = c;
    return true;
}
#endif

// Fetch a character from the device input buffer, waiting if necessary
static unsigned char 
avr32_serial_getc_interrupt(serial_channel *chan)
{
    avr32_serial_info * const avr32_chan = (avr32_serial_info *) chan->dev_priv;
    volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
    CYG_WORD32 c;

    // Read data
    c = dev->rhr;
    return (unsigned char) c;
}

#if (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL0) && CYGNUM_IO_SERIAL_AVR32_SERIAL0_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL1) && CYGNUM_IO_SERIAL_AVR32_SERIAL1_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL2) && CYGNUM_IO_SERIAL_AVR32_SERIAL2_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL3) && CYGNUM_IO_SERIAL_AVR32_SERIAL3_BUFSIZE == 0) \
 || (defined(CYGPKG_IO_SERIAL_AVR32_SERIAL4) && CYGNUM_IO_SERIAL_AVR32_SERIAL4_BUFSIZE == 0)
static unsigned char 
avr32_serial_getc_polled(serial_channel *chan)
{
    avr32_serial_info * const avr32_chan = (avr32_serial_info *) chan->dev_priv;
    volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
    CYG_WORD32 c;

    while (!dev->CSR.usart_mode.rxrdy)
        CYG_EMPTY_STATEMENT;
    // Read data
    c = dev->rhr;
    return (unsigned char) c;
}
#endif
// Set up the device characteristics; baud rate, etc.
static Cyg_ErrNo
avr32_serial_set_config(serial_channel *chan, cyg_uint32 key,
                       const void *xbuf, cyg_uint32 *len)
{
    switch (key) {
    case CYG_IO_SET_CONFIG_SERIAL_INFO:
    {
        cyg_serial_info_t *config = (cyg_serial_info_t *)xbuf;
        if ( *len < sizeof(cyg_serial_info_t) ) {
            return -EINVAL;
        }
        *len = sizeof(cyg_serial_info_t);
        if ( true != avr32_serial_config_port(chan, config, false) )
            return -EINVAL;
    }
    break;
    case CYGOPT_IO_SERIAL_TIMEOUT:
    {
        avr32_serial_info * const avr32_chan = (avr32_serial_info *) chan->dev_priv;
        volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
        cyg_uint32 timeout = *((cyg_uint32 *)xbuf);
        if ( *len < sizeof(cyg_uint32) )
            return -EINVAL;

        dev->rtor = timeout;
        dev->cr   = AVR32_USART_RETTO_MASK;
    }
      break;
#ifdef CYGOPT_IO_SERIAL_FLOW_CONTROL_HW
    case CYG_IO_SET_CONFIG_SERIAL_HW_RX_FLOW_THROTTLE:
    {
        // RX flow control involves just the RTS line. Most of the
        // work is done by the hardware depending on the state of
        // the fifo. This option serves mainly to drop RTS if
        // higher-level code is running out of buffer space, even
        // if the fifo is not yet full.
        avr32_serial_info * const avr32_chan = (avr32_serial_info *) chan->dev_priv;
        volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
        cyg_uint32 *f = (cyg_uint32 *)xbuf;
        unsigned char mask=0;
        if ( *len < sizeof(*f) )
            return -EINVAL;

        if ( chan->config.flags & CYGNUM_SERIAL_FLOW_RTSCTS_RX )
            mask = AVR32_USART_RTSDIS_MASK;
        else
            mask = AVR32_USART_RTSEN_MASK;
#if 0
        if ( chan->config.flags & CYGNUM_SERIAL_FLOW_DSRDTR_RX )
            mask |= AVR32_USART_DTRDIS_MASK;
        else
            mask |= AVR32_USART_DTREN_MASK;
#endif
        dev->cr = mask; 
    }
        break;
        
    case CYG_IO_SET_CONFIG_SERIAL_HW_FLOW_CONFIG:
      break;
#endif
    default:
        return -EINVAL;
    }
    return ENOERR;
}

// Enable the transmitter on the device
static void
avr32_serial_start_xmit(serial_channel *chan)
{
    avr32_serial_info * const avr32_chan = (avr32_serial_info *) chan->dev_priv;
    volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    unsigned char * chars;
    xmt_req_reply_t res;
    //cyg_drv_dsr_lock();
    // wait until CTS is inactive 
   /* while(dev->csr & AVR32_USART_CSR_CTS_MASK)
    {
      hal_delay_us(10);
    }*/
    if ((avr32_chan->flags & SIFLG_XMIT_CONTINUE) == 0) {
        res = (chan->callbacks->data_xmt_req)(chan, 0xffff, &avr32_chan->transmit_size, &chars);
        switch (res)
        {
            case CYG_XMT_OK:
                CYG_PDAM_SET_CHANEL(avr32_chan->pdca_tx_channel,chars,
                  avr32_chan->transmit_size,avr32_chan->dma_pid_tx,0,0,0);
                CYG_PDMA_ENABLE_INTERRUPT(avr32_chan->pdca_tx_channel,true,
                  true, false);
                CYG_PDMA_ENABLE_CHANEL(avr32_chan->pdca_tx_channel);

                avr32_chan->flags |= SIFLG_XMIT_CONTINUE;

                break;
            case CYG_XMT_DISABLED:
                (chan->callbacks->xmt_char)(chan);  // Kick transmitter
                avr32_chan->flags |= SIFLG_XMIT_CONTINUE;
                dev->idr = AVR32_USART_CSR_TXRDY_MASK;
                break;
            default:
                // No data or unknown error - can't do anything about it
                break;
        }
    }
    //cyg_drv_dsr_unlock();
#else
	//cyg_drv_dsr_lock();
	avr32_chan->flags |= SIFLG_XMIT_CONTINUE;
        dev->cr = AVR32_USART_CR_TXEN_MASK;
	dev->ier           = AVR32_USART_CSR_TXRDY_MASK;
	//cyg_drv_dsr_unlock();
#endif
}

// Disable the transmitter on the device
static void 
avr32_serial_stop_xmit(serial_channel *chan)
{
    avr32_serial_info * const avr32_chan = (avr32_serial_info *) chan->dev_priv;
    volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    CYG_PDMA_DISABLE_CHANEL(avr32_chan->pdca_tx_channel);
#else
    dev->idr = AVR32_USART_CSR_TXRDY_MASK;
    dev->cr = AVR32_USART_CR_TXDIS_MASK;
#endif
    avr32_chan->flags &= ~SIFLG_XMIT_CONTINUE;	
}

// Serial I/O - low level interrupt handler (ISR)
static void       
avr32_serial_DSR(cyg_vector_t vector, cyg_ucount32 count, cyg_addrword_t data)
{
    serial_channel *chan = (serial_channel *)data;
    avr32_serial_info * const avr32_chan = (avr32_serial_info *)chan->dev_priv;
    volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
    cyg_uint32 _csr, _ier = 0;

    _csr = dev->csr;

#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    //If some input data transfer is ongoing between ecos initialization
    //and channel opening the ping-pong buffers can be full witch can
    //produce some errors
    if(avr32_chan->trans_rdy)
    {
        const cyg_uint8 cb = avr32_chan->curbuf, nb = cb ^ 0x01;
        cyg_uint8 * p = avr32_chan->rcv_buffer[cb], * end, * start;
        
