Filip83/ecos-devel/ecos-3.0/packages/devs/serial/avr32/uc3c/current/src/avr32_serial.c
        /*CYG_ASSERT((end - p) <= avr32_chan->ping_pong_size ,
                "Transfer is longer than buffer dma end\n");*/
        if(CYG_PDMA_IS_TRANSFER_COMPLETE(avr32_chan->pdca_rx_channel))
        {
            end   = avr32_chan->rcv_buffer[cb] + avr32_chan->ping_pong_size;
            if(avr32_chan->end == avr32_chan->rcv_buffer[cb])
            {
                start = avr32_chan->rcv_buffer[cb];
            }
            else
            {
                start = avr32_chan->end;
            }
            avr32_chan->end = avr32_chan->rcv_buffer[nb];
            CYG_PDMA_RELOAD(avr32_chan->pdca_rx_channel,avr32_chan->rcv_buffer[cb],
				avr32_chan->ping_pong_size);
            diag_printf("SW\n");
        }
        else if(_csr & AVR32_USART_CSR_TIMEOUT_MASK)
        {
            end = avr32_chan->pdca_rx_channel->mar;
            if(avr32_chan->end == avr32_chan->rcv_buffer[cb])
                start = avr32_chan->rcv_buffer[cb];
            else
                start = avr32_chan->end;
            
            avr32_chan->end = end;
        }
        
        diag_printf("%p, %p, %p\n",start, end,avr32_chan->end);
        p = start;
        
        CYG_ASSERT((end - p) <= avr32_chan->ping_pong_size ,
                "Transfer is longer than buffer dma end\n");

        while (p < end) 
        {
            rcv_req_reply_t res;
            int space_avail;
            unsigned char *space;

            res = (chan->callbacks->data_rcv_req)(
              chan,
              end - start,
              &space_avail,
              &space
            );

            switch (res)
            {
                case CYG_RCV_OK:
                    memcpy(space, p, space_avail);
                    (chan->callbacks->data_rcv_done)(chan, space_avail);
                    p += space_avail;
                    break;
                case CYG_RCV_DISABLED:
                    (chan->callbacks->rcv_char)(chan, *p++);
                    break;
                default:
                    // Buffer full or unknown error, can't do anything about it
                    // Discard data
                    p = end;
                    break;
            }      
        }
        
        avr32_chan->trans_rdy = false;
        avr32_chan->curbuf = nb;
       
            
        CYG_PDMA_ENABLE_INTERRUPT(avr32_chan->pdca_rx_channel,true,
                      true, false);
        
        
    }
	
#else
    if(_csr & AVR32_USART_CSR_RXRDY_MASK)
    {
        unsigned char c;
        c = dev->rhr;
        (chan->callbacks->rcv_char)(chan, c);
        _ier |= AVR32_USART_IER_RXRDY_MASK;
    }		  
#endif

#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    if (CYG_PDMA_IS_TRANSFER_COMPLETE(avr32_chan->pdca_tx_channel) &&
	    CYG_PDMA_IS_ENABLED(avr32_chan->pdca_tx_channel)) 
    {
        (chan->callbacks->data_xmt_done)(chan, avr32_chan->transmit_size);
        if (avr32_chan->flags & SIFLG_XMIT_CONTINUE) {
            unsigned char * chars;
            xmt_req_reply_t res;

            res = (chan->callbacks->data_xmt_req)(
                    chan, 0xffff, &avr32_chan->transmit_size, &chars);

            switch (res)
            {
                case CYG_XMT_OK:
                    CYG_PDAM_SET_CHANEL(avr32_chan->pdca_tx_channel,chars,
                      avr32_chan->transmit_size,avr32_chan->dma_pid_tx,0,0,0);
                    CYG_PDMA_ENABLE_INTERRUPT(avr32_chan->pdca_tx_channel,true,
                      true, false);
                    CYG_PDMA_ENABLE_CHANEL(avr32_chan->pdca_tx_channel);

                    avr32_chan->flags |= SIFLG_XMIT_CONTINUE;
                    break;
                default:
                    // No data or unknown error - can't do anything about it
                    // CYG_XMT_DISABLED should not happen here!
                    break;
            }
        }
    }
#else
    if((_csr & AVR32_USART_CSR_TXRDY_MASK) && (avr32_chan->flags & SIFLG_XMIT_CONTINUE))
    {
        avr32_chan->flags &= ~SIFLG_XMIT_BUSY;  
        (chan->callbacks->xmt_char)(chan);
        if(avr32_chan->flags & SIFLG_XMIT_CONTINUE)
            _ier |= AVR32_USART_IER_TXRDY_MASK;
    }
#endif
#ifdef CYGINT_IO_SERIAL_LINE_STATUS_HW
    if(_csr & AVR32_USART_CSR_OVRE_MASK)
    {
        diag_printf("err\n");
        cyg_serial_line_status_t stat;
        stat.which = CYGNUM_SERIAL_STATUS_OVERRUNERR;
        (chan->callbacks->indicate_status)(chan, &stat );
        _ier |= AVR32_USART_IER_OVRE_MASK;
    }
    if(_csr & AVR32_USART_CSR_FRAME_MASK)
    {
        //diag_printf("err\n");
        cyg_serial_line_status_t stat;
        stat.which = CYGNUM_SERIAL_STATUS_FRAMEERR;
        (chan->callbacks->indicate_status)(chan, &stat );
        _ier |= AVR32_USART_IER_FRAME_MASK;
    }

    if(_csr & AVR32_USART_CSR_PARE_MASK)
    {
        cyg_serial_line_status_t stat;
        stat.which = CYGNUM_SERIAL_STATUS_FRAMEERR;
        (chan->callbacks->indicate_status)(chan, &stat );
        _ier |= AVR32_USART_IER_PARE_MASK;
    }
    if(_csr & AVR32_USART_CSR_RXBRK_MASK)
    {
        cyg_serial_line_status_t stat;
        stat.which = CYGNUM_SERIAL_STATUS_BREAK;
        (chan->callbacks->indicate_status)(chan, &stat );
        _ier |= AVR32_USART_IER_RXBRK_MASK;
    }
#ifdef CYGOPT_IO_SERIAL_FLOW_CONTROL_HW
    if(_csr & AVR32_USART_CSR_CTSIC_MASK)
    {
        cyg_serial_line_status_t stat;
        stat.which = CYGNUM_SERIAL_STATUS_FLOW;
        stat.value = (0 != (dev->CSR.usart_mode.cts));
        (chan->callbacks->indicate_status)(chan, &stat );
        _ier |= AVR32_USART_IER_CTSIC_MASK;
    }
#if 0
    if(_csr & AVR32_USART_CSR_DCDIC_MASK)
    {
        cyg_serial_line_status_t stat;
        stat.which = CYGNUM_SERIAL_STATUS_CARRIERDETECT;
        stat.value = (0 != (dev->CSR.usart_mode.dcd));
        (chan->callbacks->indicate_status)(chan, &stat );
        _ier |= AVR32_USART_IER_DCDIC_MASK;
    }
    if(_csr & AVR32_USART_CSR_DSRIC_MASK)
    {
        cyg_serial_line_status_t stat;
        stat.which = CYGNUM_SERIAL_STATUS_FLOW;
        stat.value = (0 != (dev->CSR.usart_mode.dsr));
        (chan->callbacks->indicate_status)(chan, &stat );
        _ier |= AVR32_USART_IER_DSRIC_MASK;
    }
    if(_csr & AVR32_USART_CSR_RIIC_MASK)
    {
        cyg_serial_line_status_t stat;
        stat.which = CYGNUM_SERIAL_STATUS_RINGINDICATOR;
        stat.value = (0 != (dev->CSR.usart_mode.ri));
        _ier |= AVR32_USART_IER_RIIC_MASK;
    }
#endif
    
#endif
#endif
    //dev->cr = AVR32_USART_STTTO_MASK | AVR32_USART_RETTO_MASK;
    dev->cr = AVR32_USART_CR_RSTSTA_MASK;
    dev->ier = _ier;// | AVR32_USART_IER_TIMEOUT_MASK;   
}


// Serial I/O - high level interrupt handler (DSR)
static cyg_uint32
avr32_serial_ISR(cyg_vector_t vector, cyg_addrword_t data)
{
    serial_channel * const chan = (serial_channel *) data;
    avr32_serial_info * const avr32_chan = (avr32_serial_info *) chan->dev_priv;
    volatile avr32_usart_t  *dev = avr32_chan->usart_dev;
    cyg_uint32 ret = CYG_ISR_HANDLED | CYG_ISR_CALL_DSR;
    // Check if we have an interrupt pending - note that the interrupt
    // is pending of the low bit of the isr is *0*, not 1.
    
   /* if((dev->csr & 0x1) && dev->csr & AVR32_USART_CSR_TIMEOUT_MASK)
    {
        dev->cr = AVR32_USART_STTTO_MASK | AVR32_USART_RETTO_MASK;
        dev->ier = AVR32_USART_IER_TIMEOUT_MASK;
        return CYG_ISR_HANDLED;
    }*/
    
    dev->idr = dev->csr & dev->imr;
    
#ifdef CYGINT_IO_SERIAL_BLOCK_TRANSFER
    if(dev->csr & AVR32_USART_CSR_TIMEOUT_MASK)
    {
        if(CYG_PDMA_IS_TRANSFER_COMPLETE(avr32_chan->pdca_rx_channel))
        {
            //diag_printf("A1\n");
            CYG_PDMA_DISABLE_INTERRUPT(avr32_chan->pdca_rx_channel);
           /* const cyg_uint8 cb = avr32_chan->curbuf;
            avr32_chan->end = avr32_chan->rcv_buffer[cb] + avr32_chan->ping_pong_size;
           /* CYG_PDMA_RELOAD(avr32_chan->pdca_rx_channel,avr32_chan->rcv_buffer[cb],
                                 0 );*/
             avr32_chan->trans_rdy = true;
             /*dev->cr = AVR32_USART_STTTO_MASK | AVR32_USART_RETTO_MASK;
             dev->ier = AVR32_USART_IER_TIMEOUT_MASK;*/
             ret |= CYG_ISR_CALL_DSR;
        }
        else
        {
            
            // set data buffer length
            const cyg_uint8 cb = avr32_chan->curbuf;
           // diag_printf("A2\n");
            if(avr32_chan->end != avr32_chan->pdca_rx_channel->mar)
            {
                //CYG_PDMA_DISABLE_INTERRUPT(avr32_chan->pdca_rx_channel);
                /*register cyg_uint32 end;
                CYG_PDMA_DISABLE_CHANEL(avr32_chan->pdca_rx_channel);

