Filip83/ecos-devel/ecos-3.0/packages/devs/serial/avr32/uc3c/current/src/avr32_serial.c
                end = avr32_chan->pdca_rx_channel->mar;
                avr32_chan->pdca_rx_channel->tcr = 0;
                //CYG_PDMA_FORCE_RELOAD(avr32_chan->pdca_rx_channel);
                CYG_PDMA_ENABLE_CHANEL(avr32_chan->pdca_rx_channel);
                avr32_chan->end = end;
                 /*CYG_PDMA_RELOAD(avr32_chan->pdca_rx_channel,avr32_chan->rcv_buffer[cb],
                                     0);*/
                 //diag_printf("A2\n");
                 avr32_chan->trans_rdy = true;
                 ret |= CYG_ISR_CALL_DSR;
            }
            else
            {
                dev->cr = AVR32_USART_STTTO_MASK | AVR32_USART_RETTO_MASK;
                dev->ier = AVR32_USART_IER_TIMEOUT_MASK;
                ret &= ~CYG_ISR_CALL_DSR;
            }
                
        }
    }
    else
    {
        if(CYG_PDMA_IS_TRANSFER_COMPLETE(avr32_chan->pdca_rx_channel))
        {
            CYG_PDMA_DISABLE_INTERRUPT(avr32_chan->pdca_rx_channel);
            //diag_printf("A3\n");
           /* CYG_PDMA_DISABLE_INTERRUPT(avr32_chan->pdca_rx_channel);
            const cyg_uint8 cb = avr32_chan->curbuf;
            avr32_chan->end = avr32_chan->rcv_buffer[cb] + avr32_chan->ping_pong_size;
            /*CYG_PDMA_RELOAD(avr32_chan->pdca_rx_channel,avr32_chan->rcv_buffer[cb],
                                 0 );*/
             avr32_chan->trans_rdy = true;
             /*dev->cr = AVR32_USART_STTTO_MASK | AVR32_USART_RETTO_MASK;
             dev->ier = AVR32_USART_IER_TIMEOUT_MASK;*/
             ret |= CYG_ISR_CALL_DSR;
        }
    }
    
    

    if(CYG_PDMA_IS_ENABLED(avr32_chan->pdca_tx_channel))
    {
      if(CYG_PDMA_IS_TRANSFER_COMPLETE(avr32_chan->pdca_tx_channel))
      {
            CYG_PDMA_DISABLE_INTERRUPT(avr32_chan->pdca_tx_channel);
            ret |= CYG_ISR_CALL_DSR;
      }
    }
#endif
    /*dev->cr = AVR32_USART_STTTO_MASK | AVR32_USART_RETTO_MASK;
    dev->ier = AVR32_USART_IER_TIMEOUT_MASK;  */

    return ret;
}
#endif

#endif